app/services/weather_service.rb

    def self.get_forecast(address_or_zip)
        zip_code = extract_zip_code(address_or_zip)
        cache_key = "weather_forecast_#{zip_code}"
        cached_forecast = Rails.cache.read(cache_key)
        return cached_forecast.merge(cached: true) if cached_forecast
        address_data =  if address_or_zip.is_a? (Address)
                            address_or_zip
                        else
                            geocoded = GeocodingService.geocode(address_or_zip)
                            Address.find_or_create_by(geocoded) if geocoded
---
INSERT INTO "addresses" ("street", "city", "state", "zip_code", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"